Autodesk.Revit.DB.Structure.MemberForcesServiceData.GetCurrentElements
Returns the list of Ids of the current elements.
Returns:
Ids of the current elements. Contains the family base element to which the Member Forces parameters belongs.
Since:
2016

Autodesk.Revit.DB.Structure.MemberForcesServiceData.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.Structure.MemberForcesServiceData.Document
The current document.
Since:
2016

Autodesk.Revit.DB.Structure.MemberForcesServiceData
The data needed by member forces server to perform type definition.
Since:
2016